12/data/attachments/18f3a0e4465ba997.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_67b0f2e2-c6c3-4055-a03d-39e9a1ce6a9f</nif:username>
            <nif:friendToBeAdded>Tiffany_phone_Friend_72468_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>